YCSB-outputs/hbase-exec-15-1000000-a-17-rf_1.txt
/usr/local/openjdk-11/bin/java -cp //opt/hbase-2.2.7-client/conf:/opt/ycsb/hbase2-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/hbase2-binding/lib/commons-logging-1.2.jar:/opt/ycsb/hbase2-binding/lib/hbase2-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/hbase2-binding/lib/findbugs-annotations-1.3.9-1.jar:/opt/ycsb/hbase2-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/hbase2-binding/lib/audience-annotations-0.5.0.jar:/opt/ycsb/hbase2-binding/lib/log4j-1.2.17.jar:/opt/ycsb/hbase2-binding/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/hbase2-binding/lib/hbase-shaded-client-2.2.3.jar:/opt/ycsb/hbase2-binding/lib/slf4j-log4j12-1.7.25.jar site.ycsb.Client -db site.ycsb.db.hbase2.HBaseClient2 -s -P /opt/ycsb/workloads/workloada -p table=usertable -p columnfamily=family -p recordcount=1000000 -p operationcount=10000 -t
Command line: -db site.ycsb.db.hbase2.HBaseClient2 -s -P /opt/ycsb/workloads/workloada -p table=usertable -p columnfamily=family -p recordcount=1000000 -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2021-09-10 20:09:15:251 0 sec: 0 operations; est completion in 0 second 
2021-09-10 20:09:15,337 WARN  [Thread-3] util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.hadoop.security.authentication.util.KerberosUtil (file:/opt/ycsb/hbase2-binding/lib/hbase-shaded-client-2.2.3.jar) to method sun.security.krb5.Config.getInstance()
WARNING: Please consider reporting this to the maintainers of org.apache.hadoop.security.authentication.util.KerberosUtil
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
2021-09-10 20:09:15,680 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:zookeeper.version=3.4.10-39d3a4f269333c922ed3db283be479f9deacaa0f, built on 03/23/2017 10:13 GMT
2021-09-10 20:09:15,680 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:host.name=85bbf37f4576
2021-09-10 20:09:15,680 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.version=11.0.12
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.vendor=Oracle Corporation
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.home=/usr/local/openjdk-11
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.class.path=//opt/hbase-2.2.7-client/conf:/opt/ycsb/hbase2-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/hbase2-binding/lib/commons-logging-1.2.jar:/opt/ycsb/hbase2-binding/lib/hbase2-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/hbase2-binding/lib/findbugs-annotations-1.3.9-1.jar:/opt/ycsb/hbase2-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/hbase2-binding/lib/audience-annotations-0.5.0.jar:/opt/ycsb/hbase2-binding/lib/log4j-1.2.17.jar:/opt/ycsb/hbase2-binding/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/hbase2-binding/lib/hbase-shaded-client-2.2.3.jar:/opt/ycsb/hbase2-binding/lib/slf4j-log4j12-1.7.25.jar
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.library.path=/usr/java/packages/lib:/usr/lib64:/lib64:/lib:/usr/lib
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.io.tmpdir=/tmp
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:java.compiler=<NA>
2021-09-10 20:09:15,681 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:os.name=Linux
2021-09-10 20:09:15,682 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:os.arch=amd64
2021-09-10 20:09:15,682 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:os.version=4.19.0-17-amd64
2021-09-10 20:09:15,682 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:user.name=root
2021-09-10 20:09:15,682 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:user.home=/root
2021-09-10 20:09:15,682 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Client environment:user.dir=/
2021-09-10 20:09:15,685 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Initiating client connection, connectString=hmaster:2181,hregion1:2181,hregion2:2181 sessionTimeout=90000 watcher=org.apache.hadoop.hbase.zookeeper.ReadOnlyZKClient$$Lambda$83/0x0000000840145c40@204130d1
2021-09-10 20:09:15,727 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4-SendThread(hbase_hregion2.1.rxltnut7372vtlmo25sn49x92.pi-cluster-net:2181)] zookeeper.ClientCnxn: Opening socket connection to server hbase_hregion2.1.rxltnut7372vtlmo25sn49x92.pi-cluster-net/10.0.2.10:2181. Will not attempt to authenticate using SASL (unknown error)
2021-09-10 20:09:15,739 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4-SendThread(hbase_hregion2.1.rxltnut7372vtlmo25sn49x92.pi-cluster-net:2181)] zookeeper.ClientCnxn: Socket connection established to hbase_hregion2.1.rxltnut7372vtlmo25sn49x92.pi-cluster-net/10.0.2.10:2181, initiating session
2021-09-10 20:09:15,762 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4-SendThread(hbase_hregion2.1.rxltnut7372vtlmo25sn49x92.pi-cluster-net:2181)] zookeeper.ClientCnxn: Session establishment complete on server hbase_hregion2.1.rxltnut7372vtlmo25sn49x92.pi-cluster-net/10.0.2.10:2181, sessionid = 0x27bceb9e29d0018, negotiated timeout = 90000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-10 20:09:25:222 10 sec: 433 operations; 43.3 current ops/sec; est completion in 3 minutes [READ: Count=229, Max=153087, Min=7500, Avg=20766.51, 90=29199, 99=72767, 99.9=153087, 99.99=153087] [UPDATE: Count=205, Max=91647, Min=11208, Avg=19636.1, 90=22095, 99=69375, 99.9=91647, 99.99=91647] 
2021-09-10 20:09:35:222 20 sec: 982 operations; 54.91 current ops/sec; est completion in 3 minutes [READ: Count=266, Max=38719, Min=6904, Avg=18139.75, 90=26303, 99=32927, 99.9=38719, 99.99=38719] [UPDATE: Count=282, Max=103487, Min=11080, Avg=18088.13, 90=21119, 99=36351, 99.9=103487, 99.99=103487] 
2021-09-10 20:09:45:222 30 sec: 1502 operations; 52 current ops/sec; est completion in 2 minutes [READ: Count=249, Max=57439, Min=6844, Avg=17685.16, 90=26543, 99=37119, 99.9=57439, 99.99=57439] [UPDATE: Count=271, Max=30943, Min=10736, Avg=16773.21, 90=19359, 99=24815, 99.9=30943, 99.99=30943] 
2021-09-10 20:09:55:222 40 sec: 1930 operations; 42.8 current ops/sec; est completion in 2 minutes [READ: Count=206, Max=3020799, Min=6544, Avg=32578.52, 90=26831, 99=44031, 99.9=3020799, 99.99=3020799] [UPDATE: Count=223, Max=677887, Min=9960, Avg=19173.74, 90=18847, 99=31103, 99.9=677887, 99.99=677887] 
2021-09-10 20:10:05:222 50 sec: 2523 operations; 59.3 current ops/sec; est completion in 2 minutes [READ: Count=299, Max=39231, Min=5936, Avg=17567.76, 90=26159, 99=32047, 99.9=39231, 99.99=39231] [UPDATE: Count=293, Max=39295, Min=9568, Avg=16090.13, 90=18703, 99=27743, 99.9=39295, 99.99=39295] 
2021-09-10 20:10:15:222 60 sec: 3112 operations; 58.9 current ops/sec; est completion in 2 minutes [READ: Count=294, Max=49055, Min=6516, Avg=18126.95, 90=27855, 99=34367, 99.9=49055, 99.99=49055] [UPDATE: Count=295, Max=36863, Min=8816, Avg=15718.05, 90=18735, 99=31359, 99.9=36863, 99.99=36863] 
2021-09-10 20:10:16,000 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4] zookeeper.ZooKeeper: Session: 0x27bceb9e29d0018 closed
2021-09-10 20:10:16,005 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x6e0061c4-EventThread] zookeeper.ClientCnxn: EventThread shut down for session: 0x27bceb9e29d0018
2021-09-10 20:10:25:222 70 sec: 3521 operations; 40.9 current ops/sec; est completion in 2 minutes [READ: Count=199, Max=3186687, Min=6740, Avg=34437.44, 90=27439, 99=39839, 99.9=3186687, 99.99=3186687] [UPDATE: Count=210, Max=42943, Min=8464, Avg=14876.97, 90=18079, 99=23711, 99.9=42943, 99.99=42943] 
2021-09-10 20:10:35:222 80 sec: 4015 operations; 49.4 current ops/sec; est completion in 2 minutes [READ: Count=262, Max=2027519, Min=6036, Avg=24852.47, 90=26719, 99=31615, 99.9=2027519, 99.99=2027519] [UPDATE: Count=232, Max=29583, Min=9072, Avg=14944.59, 90=17887, 99=24159, 99.9=29583, 99.99=29583] 
2021-09-10 20:10:45:222 90 sec: 4643 operations; 62.8 current ops/sec; est completion in 1 minute [READ: Count=314, Max=46687, Min=5992, Avg=16985.71, 90=26751, 99=32015, 99.9=46687, 99.99=46687] [UPDATE: Count=314, Max=25407, Min=8584, Avg=14712.62, 90=17439, 99=20959, 99.9=25407, 99.99=25407] 
2021-09-10 20:10:55:222 100 sec: 5235 operations; 59.2 current ops/sec; est completion in 1 minute [READ: Count=301, Max=90047, Min=5624, Avg=18863.71, 90=28607, 99=50175, 99.9=90047, 99.99=90047] [UPDATE: Count=291, Max=31615, Min=9360, Avg=14814.28, 90=17743, 99=24079, 99.9=31615, 99.99=31615] 
2021-09-10 20:11:05:222 110 sec: 5828 operations; 59.3 current ops/sec; est completion in 1 minute [READ: Count=312, Max=100863, Min=5632, Avg=19155.72, 90=27743, 99=66623, 99.9=100863, 99.99=100863] [UPDATE: Count=282, Max=35647, Min=8424, Avg=14180.37, 90=17183, 99=27519, 99.9=35647, 99.99=35647] 
2021-09-10 20:11:15:222 120 sec: 6469 operations; 64.1 current ops/sec; est completion in 1 minute [READ: Count=320, Max=91711, Min=5872, Avg=17339.64, 90=26863, 99=36159, 99.9=91711, 99.99=91711] [UPDATE: Count=320, Max=26431, Min=8472, Avg=13807.88, 90=16287, 99=20991, 99.9=26431, 99.99=26431] 
2021-09-10 20:11:25:222 130 sec: 6900 operations; 43.1 current ops/sec; est completion in 59 seconds [READ: Count=216, Max=2822143, Min=6248, Avg=32697.07, 90=28559, 99=80319, 99.9=2822143, 99.99=2822143] [UPDATE: Count=215, Max=31567, Min=8528, Avg=13589.64, 90=16231, 99=21471, 99.9=31567, 99.99=31567] 
2021-09-10 20:11:35:222 140 sec: 7563 operations; 66.3 current ops/sec; est completion in 46 seconds [READ: Count=308, Max=63487, Min=5956, Avg=16916.27, 90=25695, 99=41599, 99.9=63487, 99.99=63487] [UPDATE: Count=355, Max=22351, Min=8208, Avg=13410.72, 90=15751, 99=19215, 99.9=22351, 99.99=22351] 
2021-09-10 20:11:45:222 150 sec: 8235 operations; 67.2 current ops/sec; est completion in 33 seconds [READ: Count=320, Max=58303, Min=6112, Avg=16401.26, 90=25391, 99=34463, 99.9=58303, 99.99=58303] [UPDATE: Count=352, Max=28207, Min=8016, Avg=13469.74, 90=16335, 99=23583, 99.9=28207, 99.99=28207] 
2021-09-10 20:11:55:222 160 sec: 8740 operations; 50.5 current ops/sec; est completion in 24 seconds [READ: Count=231, Max=1818623, Min=5832, Avg=24803.04, 90=25711, 99=39999, 99.9=1818623, 99.99=1818623] [UPDATE: Count=274, Max=21919, Min=8376, Avg=13482.92, 90=16007, 99=20079, 99.9=21919, 99.99=21919] 
2021-09-10 20:12:05:222 170 sec: 8951 operations; 21.1 current ops/sec; est completion in 20 seconds [READ: Count=113, Max=5935103, Min=6040, Avg=81929.68, 90=28719, 99=1187839, 99.9=5935103, 99.99=5935103] [UPDATE: Count=98, Max=19871, Min=9112, Avg=13344.86, 90=15879, 99=19743, 99.9=19871, 99.99=19871] 
2021-09-10 20:12:15:222 180 sec: 9618 operations; 66.7 current ops/sec; est completion in 8 second [READ: Count=356, Max=44831, Min=6228, Avg=16421.2, 90=26255, 99=37759, 99.9=44831, 99.99=44831] [UPDATE: Count=311, Max=51199, Min=8080, Avg=13290.43, 90=15767, 99=22191, 99.9=51199, 99.99=51199] 
2021-09-10 20:12:25:222 190 sec: 9900 operations; 28.2 current ops/sec; est completion in 2 second [READ: Count=136, Max=2473983, Min=6168, Avg=48535.76, 90=28415, 99=1575935, 99.9=2473983, 99.99=2473983] [UPDATE: Count=146, Max=26367, Min=8632, Avg=13661.7, 90=16071, 99=20495, 99.9=26367, 99.99=26367] 
2021-09-10 20:12:27:347 192 sec: 10000 operations; 47.04 current ops/sec; [READ: Count=49, Max=1993727, Min=6644, Avg=57623.18, 90=27535, 99=1993727, 99.9=1993727, 99.99=1993727] [CLEANUP: Count=2, Max=12279, Min=18, Avg=6147, 90=12279, 99=12279, 99.9=12279, 99.99=12279] [UPDATE: Count=51, Max=18095, Min=8368, Avg=13692.55, 90=16167, 99=17919, 99.9=18095, 99.99=18095] 
[OVERALL], RunTime(ms), 192126
[OVERALL], Throughput(ops/sec), 52.049176061542944
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 79
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.04111884908861893
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 79
[TOTAL_GC_TIME_%], Time(%), 0.04111884908861893
[READ], Operations, 4980
[READ], AverageLatency(us), 23083.898393574298
[READ], MinLatency(us), 5624
[READ], MaxLatency(us), 5935103
[READ], 95thPercentileLatency(us), 29695
[READ], 99thPercentileLatency(us), 48351
[READ], Return=OK, 4980
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 6147.0
[CLEANUP], MinLatency(us), 18
[CLEANUP], MaxLatency(us), 12279
[CLEANUP], 95thPercentileLatency(us), 12279
[CLEANUP], 99thPercentileLatency(us), 12279
[UPDATE], Operations, 5020
[UPDATE], AverageLatency(us), 15037.943027888447
[UPDATE], MinLatency(us), 8016
[UPDATE], MaxLatency(us), 677887
[UPDATE], 95thPercentileLatency(us), 19839
[UPDATE], 99thPercentileLatency(us), 24943
[UPDATE], Return=OK, 5020